# Pandas
- https://pandas.pydata.org/

- Python programming language for data manipulation and analysis. Useful with data structures and operations for manipulating numerical tables and time series. 
- Excel-ish

In [1]:
# Imports
import pandas as pd
import numpy as np

In [2]:
# Creating a dataframe
pd.DataFrame({'A': [1,2,3]})

   A
0  1
1  2
2  3

In [3]:
# Creating multiple columns and saving as a data frame
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
df1

   A  B
0  1  4
1  2  5
2  3  6

# Learn more about your data frame

In [4]:
# Describe
df1.describe()

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [5]:
# Info
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [6]:
# Are there any null values
df1.isnull().sum()

A    0
B    0
dtype: int64

In [7]:
# What is the shape of the frame?
df1.shape

(3, 2)

In [8]:
# Top row
df1.head(1)

   A  B
0  1  4

In [9]:
# Bottom Row
df1.tail(1)

   A  B
2  3  6

In [10]:
# Create a more complicated data frame
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
        "G": pd.Categorical(['True','False','True','False'])
    }
)
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo   True
1  1.0 2013-01-02  1.0  3  train  foo  False
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [11]:
# Data types
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      category
dtypes: category(2), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 416.0+ bytes

In [12]:
# Change data type
df2['A'] = df2['A'].astype(int)

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      category
dtypes: category(2), datetime64[ns](1), float32(1), int32(1), int64(1), object(1)
memory usage: 416.0+ bytes

In [14]:
#Check it out
df2

   A          B    C  D      E    F      G
0  1 2013-01-02  1.0  3   test  foo   True
1  1 2013-01-02  1.0  3  train  foo  False
2  1 2013-01-02  1.0  3   test  foo   True
3  1 2013-01-02  1.0  3  train  foo  False

In [15]:
# Rename a column
df2 = df2.rename(columns={"A": "AA"})
df2

   AA          B    C  D      E    F      G
0   1 2013-01-02  1.0  3   test  foo   True
1   1 2013-01-02  1.0  3  train  foo  False
2   1 2013-01-02  1.0  3   test  foo   True
3   1 2013-01-02  1.0  3  train  foo  False

In [16]:
# Make true and false 1/0
df2['G'] = df2['G'].replace({'True': 1, 'False': 0})

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AA      4 non-null      int64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      category
dtypes: category(2), datetime64[ns](1), float32(1), int32(1), int64(1), object(1)
memory usage: 416.0+ bytes

In [18]:
# Check it out
df2

   AA          B    C  D      E    F  G
0   1 2013-01-02  1.0  3   test  foo  1
1   1 2013-01-02  1.0  3  train  foo  0
2   1 2013-01-02  1.0  3   test  foo  1
3   1 2013-01-02  1.0  3  train  foo  0

# Importing data via 
- Excel
- CSV
- Clipboard

In [22]:
# From Excel
pd.read_excel('CPIAUCSL.xls')

    observation_date  CPIAUCSL
0         1947-01-01    21.480
1         1947-02-01    21.620
2         1947-03-01    22.000
3         1947-04-01    22.000
4         1947-05-01    21.950
..               ...       ...
917       2023-06-01   303.841
918       2023-07-01   304.348
919       2023-08-01   306.269
920       2023-09-01   307.481
921       2023-10-01   307.619

[922 rows x 2 columns]

In [23]:
# From CSV
pd.read_csv('CPIAUCSL.csv')

           DATE  CPIAUCSL
0    1947-01-01    21.480
1    1947-02-01    21.620
2    1947-03-01    22.000
3    1947-04-01    22.000
4    1947-05-01    21.950
..          ...       ...
917  2023-06-01   303.841
918  2023-07-01   304.348
919  2023-08-01   306.269
920  2023-09-01   307.481
921  2023-10-01   307.619

[922 rows x 2 columns]

In [26]:
# From Clipboard
df3 = pd.read_clipboard()

In [27]:
df3

    observation_date  CPIAUCSL
0         1947-01-01    21.480
1         1947-02-01    21.620
2         1947-03-01    22.000
3         1947-04-01    22.000
4         1947-05-01    21.950
..               ...       ...
917       2023-06-01   303.841
918       2023-07-01   304.348
919       2023-08-01   306.269
920       2023-09-01   307.481
921       2023-10-01   307.619

[922 rows x 2 columns]

In [30]:
df3.columns

Index(['observation_date', 'CPIAUCSL'], dtype='object')

In [33]:
df3.rename(columns={'CPIAUCSL':'CPI'})

    observation_date      CPI
0         1947-01-01   21.480
1         1947-02-01   21.620
2         1947-03-01   22.000
3         1947-04-01   22.000
4         1947-05-01   21.950
..               ...      ...
917       2023-06-01  303.841
918       2023-07-01  304.348
919       2023-08-01  306.269
920       2023-09-01  307.481
921       2023-10-01  307.619

[922 rows x 2 columns]